export default {
	"meta": {
		"index": {
			"title": "_XPROJECTNAME_ - Svelte/SSR + шаблон Firebase",
			"description": "Проста, надійна, гнучка платформа для створення гіперреактивних і надзвичайно зручних сучасних мобільних додатків."
		},
		"info": {
			"about": {
				"title": "Про _XPROJECTNAME_",
				"description": ""
			},
			"showcase": {
				"title": "Створено за допомогою _XPROJECTNAME_",
				"description": "Різні проекти, створені за допомогою _XPROJECTNAME_."
			}
		},
		"changelog": {
			"title": "Журнал змін _XPROJECTNAME_",
			"description": ""
		}
	},
	"layout": {
		"nav": {
			"links": {
				"home": {
					"text": "SB",
					"title": "_XPROJECTNAME_"
				},
				"about": {
					"text": "Що це",
					"title": "Прочитайте про _XPROJECTNAME_."
				},
				"showcase": {
					"text": "Проекти",
					"title": "Проекти, створені за допомогою _XPROJECTNAME_."
				},
				"changelog": {
					"text": "Журнал змін",
					"title": "Історія версій."
				}
			}
		},
		"footer": {
			"info": {
				"heading": "Інформація",
				"links": {
					"about": "Про _XPROJECTNAME_",
					"showcase": "Приклади",
					"changelog": "Журнал змін"
				}
			},
			"languages": {
				"heading": "Мови"
			}
		}
	},
	"page": {
		"index": {
			"intro": {
				"heading": "_XPROJECTNAME_",
				"description": "Витончений + Сапер + Firebase = ❤",
				"content": "_XPROJECTNAME_ – це хобі-проект, який було розпочато кілька років тому з метою:\nстворити легкий простий і сучасний веб-фреймворк, який зробить створення прототипів і розробку веб-проектів будь-якого масштабу легким і цікавим,\nодночасно використовуючи найкраще з сучасних інструментів і дотримуючись простих та інтуїтивно зрозумілих практик, які запалюють обидва\nкреативна та розумна архітектура."
			},
			"sections": {
				"features": {
					"heading": "особливості",
					"items": [
						{
							"heading": "Багатомовність із коробки",
							"description": "<ul class=\"browser-default\"><li>Вміст, створений сервером, перекладається</li><li> Вбудований перекладач JSON за допомогою <u>GoogleTranslate</u></li><li> Можливість збереження динамічних значень у текстовому вмісті за допомогою <u>XDATA</u> (хитре хакерське рішення)</li><li> Перекладене рішення моделей Firebase</li></ul>"
						},
						{
							"heading": "SEO Friendly",
							"description": "<ul class=\"browser-default\"><li>SSR – візуалізація на стороні сервера, надана Sapper</li><li> Компонент Google Analytics</li><li> Належне використання багатомовних URL-адрес і мета-hreflang</li><li> Генератор карт сайту</li></ul>"
						},
						{
							"heading": "Складні переадресації",
							"description": "Настроювані на сервері перенаправлення дозволяють легко налаштовувати перенаправлення URL-адрес, а також створювати складні правила перенаправлення та поведінку."
						},
						{
							"heading": "Швидко палає",
							"description": "Кожен, хто коли-небудь чув про Svelte, насамперед знає, що це <b>найшвидший і найлегший повний каркас SPA</b> у світі.<p> _XPROJECTNAME_ не вплинув на продуктивність Свелта та Сапера. Firebase також є одним із найшвидших BE за умови правильного використання.</p><p> Веб-сайти, створені за допомогою _XPROJECTNAME_, отримують <u>100 тестів</u> на PageSpped як для комп’ютерів, так і для мобільних пристроїв.</p>"
						},
						{
							"heading": "Локальні емулятори Firebase",
							"description": "Firebase — це зріла система, яка надає достатньо функцій та інструментів для розробки та тестування всього локально."
						}
					]
				},
				"drawbacks": {
					"heading": "Проблеми та виклики",
					"items": [
						{
							"heading": "синхронізація package.json і functions/package.json",
							"description": "Щоб налаштувати _XPROJECTNAME_, потрібно мати каталог /functions, вміст якого буде розгорнуто у Firebase.<p> Тому йому потрібен власний package.json, який містить пакети, необхідні як для Svelte &amp; Sapper, так і для Firebase.</p><p> По суті, це означає, що будь-який пакет, доданий до <u>package.json</u> під час процесу розробки, потрібно буде додати до <u>функцій/packages.json</u> .</p>"
						},
						{
							"heading": "Немає доступу до атрибута lang початкового тегу html",
							"description": "Щоб отримати найкращу багатомовну платформу, вам також потрібно вказати атрибут lang у кореневому тегу html.<p> Але, на жаль, поточна версія Sapper не підтримує користувальницькі заповнювачі в <u>template.html</u> .</p><p> Ось чому за замовчуванням <u>атрибут lang</u> не вказано, і ми використовуємо лише метадані <u>hreflang</u> .</p>"
						},
						{
							"heading": "Матеріалізуйте CSS",
							"description": "Наразі _XPROJECTNAME_ використовує Materialize як структуру CSS, оскільки вона проста та інтуїтивно зрозуміла у використанні.\nОднак правильно, здається, що він не отримує значних покращень і не росте.\nТакож у моїх особистих проектах я вже почав помічати багато обмежень і тепер розглядаю можливість переходу на інший CSS Framework\nабо представити можливість використовувати різні фреймворки."
						},
						{
							"heading": "Серверні та клієнтські сценарії можуть заплутати",
							"description": "<ul><li>Сторінки Sapper використовують два типи сценаріїв виконання: серверні та клієнтські</li><li> Серверні сценарії використовують середовище <u>node.js</u> – вони мають атрибут <u>context=&quot;module&quot;.</u></li><li> Сценарії на стороні клієнта використовують середовище браузера</li><li> Якщо ви хочете отримати всі переваги SSR, вам потрібно використовувати сценарії на стороні сервера для відтворення необхідного вмісту на стороні сервера</li></ul>"
						}
					]
				},
				"firebase_downsides": {
					"heading": "Мінуси Firebase",
					"items": [
						{
							"heading": "Обмежена кількість проектів на Firebase",
							"description": "За замовчуванням ви можете створити до 5 проектів у Firebase. Але якщо вам потрібно більше, вам буде запропоновано запросити додаткові проекти."
						},
						{
							"heading": "Пагінація Firestore",
							"description": "У Firebase немає способу реалізувати класичну розбивку сторінок зі <u>зміщенням і обмеженнями</u> , натомість вам потрібно використовувати такі поняття, як «startAfter» або «startAt», щоб вказати після або в який момент ви хочете отримати набір даних."
						},
						{
							"heading": "Синхронізація індексів Firestore",
							"description": "Firestore дозволяє (а для деяких запитів вимагає) використовувати індекси для належної продуктивності запитів.<p> Однак це дозволяє налаштовувати індекси за допомогою <u>Firebase Console</u> і <u>firestore.indexes.json</u> .</p><p> Але якщо індекси налаштовано за допомогою <u>Firebase Console,</u> вони не будуть автоматично відображені у <u>firestore.indexes.json</u> .</p><p> Тому вам потрібно зробити це вручну, тому що якщо ви розгортаєте свій код в іншому проекті Firebase, вам потрібно буде знову налаштувати індекси.</p>"
						},
						{
							"heading": "Повільна відповідь мережі",
							"description": "Схоже, Firebase має затримку холодного запуску, коли функція вузла виконується недостатньо часто."
						}
					]
				}
			}
		},
		"info": {
			"showcase": {
				"heading": "Створено за допомогою _XPROJECTNAME_",
				"description": "Ось приклади проектів, створених за допомогою _XPROJECTNAME_.",
				"projects": {
					"item": {
						"website": "веб-сайт"
					},
					"list": {
						"strangy": {
							"description": "Платформа для вільного та відкритого спілкування."
						},
						"hotauto": {
							"description": "Простий SEO-проект для продажу вживаних автомобілів."
						},
						"svitanok": {
							"description": "Додаток, де можна знайти будь-якого самостійного фахівця, записатися на прийом і залишити відгук про візити."
						}
					}
				}
			},
			"about": {
				"heading": "Про _XPROJECTNAME_",
				"description": "Sapper & Firebase схожий на арахісове масло та желе.",
				"sections": {
					"backstory": {
						"heading": "Передісторія",
						"content": "Близько 2 років тому я вирішив створити кілька веб-проектів з особистих причин..."
					},
					"disclaimer": {
						"heading": "Дісклеймер",
						"content": "_XPROJECTNAME_ — це лише шаблон, заснований на концепції та ентузіазмі, який не призначений для комерційного використання.\nОднак, якщо ви впевнені, що зможете успішно створити надійну та стабільну програму за допомогою _XPROJECTNAME_\n- немає жодних обмежень або дозволів, які вам потрібно отримати, щоб використовувати його."
					}
				}
			}
		},
		"changelog": {
			"heading": "Журнал змін",
			"description": "",
			"changes_list": {
				"heading": "Останні зміни"
			},
			"changelog_form": {
				"inputs": {
					"version": "Версія",
					"details": "Подробиці"
				}
			}
		}
	}
}
